public class Main {
    public static void main(String[] args) {
        System.out.println("hw seminar one");
        //Напишите программу, которая использует Stream API для обработки списка чисел.
        //Программа должна вывести на экран среднее значение всех четных чисел в списке.
    }
}
